#+title: Adrian Danao-Schroeder config
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
** Org Capture Templates 
    
#+begin_src emacs-lisp
(setq org-capture-templates
   '( 
    ("t" "Task" entry 
	(file+headline (lambda () (concat efs/user-dir-org "inbox.org"))"Inbox")
"* TODO %^{Task}\n
%?
:PROPERTIES:
:ID:     \t%(org-id-new)
:CREATED:\t%U
:REF:\t%a
%i
:END:
"
  :kill-buffer t)
    ("w" "Work Task" entry 
	(file+headline (lambda () (concat efs/user-dir-org "work.org"))"Tasks")
"* TODO %^{Work Task}\n
%?
:PROPERTIES:
:ID:     \t%(org-id-new)
:CREATED:\t%U
:REF:\t%a
%i
:END:
"
  :kill-buffer t)

    ("p" "Personal Task" entry 
	(file+headline (lambda () (concat efs/user-dir-org "personal.org"))"Tasks")
"* TODO %^{Personal Task}\n
%?
:PROPERTIES:
:ID:     \t%(org-id-new)
:CREATED:\t%U
:REF:\t%a
%i
:END:
"
  :kill-buffer t)




    ("i" "Quick Inbox" entry 
	(file+headline (lambda () (concat efs/user-dir-org "inbox.org"))"Inbox")
"* TODO %^{Task to inbox}\n
:PROPERTIES:
:ID:     \t%(org-id-new)
:CREATED:\t%U
:REF:\t%a
%i
:END:
"
  :immediate-finish t
  :kill-buffer t)



    ("k" "Clipboard Link to Inbox" entry 
	(file+headline (lambda () (concat efs/user-dir-org "inbox.org"))"Inbox")
"* TODO %(org-cliplink-capture)\n
:PROPERTIES:
:ID:     \t%(org-id-new)
:CREATED:\t%U
:REF:\t%a
%i
:END:
"
  :immediate-finish t
  :kill-buffer t)


    ("m" "CAD Model" entry 
	(file+headline (lambda () (concat efs/user-dir-org "personal.org"))"CAD")
"* TODO %^{Thing to CAD}\n
%?
:PROPERTIES:
:ID:     \t%(org-id-new)
:CREATED:\t%U
:Effort: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
:END:
"
  :kill-buffer t)
    ("P" "Project" entry 
	(file+headline (lambda () (concat efs/user-dir-org "personal.org"))"Projects")
"* TODO %^{Project Name}\n
%?
:PROPERTIES:
:ID:     \t%(org-id-new)
:CREATED:\t%U
:REF:\t%a 
:Effort: \t%^{effort|1:00|2:00|4:00|8:00|16:00}
:Cost-est:\t%^{Cost estimate}
%i
:END:
  "
  :kill-buffer t)
    ("B" "Book" entry 
	(file+headline (lambda () (concat efs/user-dir-org "books.org"))"Endless Pile")
"* PILE %^{Book Title}\n
%?
:PROPERTIES:
:ID:     \t%(org-id-new)
:CREATED:\t%U 
:AUTHOR:
:RECCOMMENDER:
:END:
  "
  :kill-buffer t)
    ("c" "config" entry 
	(file+headline (lambda () (concat efs/user-dir-org "personal.org"))"EMACS")
"* TODO %^{Config changes}\n
%?
:PROPERTIES:
:ID:     \t%(org-id-new)
:CREATED:\t%U 
:END:
  "
  :kill-buffer t)
    ("p" "Purchase" entry 
	(file+headline (lambda () (concat efs/user-dir-org "personal.org" ))"Purchase")
"* TODO %^{What the fuck do you want now?}\n
%?
:PROPERTIES:
:ID:     \t%(org-id-new)
:CREATED:\t%U 
:Cost:\t%^{Cost}
:END:
  "
  :kill-buffer t)





))

#+end_src
    #+RESULTS:
    | t | Task | entry | (file+headline (lambda nil (concat efs/user-dir-org inbox.org)) Inbox) | * TODO %^{Task} |

** Org Bullets

   #+begin_src emacs-lisp

   (use-package org-bullets
	  :after org
	  :hook (org-mode . org-bullets-mode)
	  :custom
	  (org-bullets-bullet-lits '(("◉" "○" "●" "○" "●" "○" "●"))))


   #+end_src

   #+RESULTS:
   | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | (lambda nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | org-tempo-setup | efs/org-mode-visual-fill | org-bullets-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | (lambda nil (display-line-numbers-mode 0)) |

** Org Visual fill

   #+begin_src emacs-lisp


   (defun efs/org-mode-visual-fill ()
	(setq visual-fill-column-width 100
	    visual-fill-column-center-text t)
	(visual-fill-column-mode 1))


    (use-package visual-fill-column
	:hook (org-mode . efs/org-mode-visual-fill))

 
   #+end_src

   #+RESULTS:
   | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-tempo-setup | efs/org-mode-visual-fill | org-bullets-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | (lambda nil (display-line-numbers-mode 0)) |

** Evil Org 
Maybe this will be better somewhere else but it works here for now
[[https://github.com/Somelauw/evil-org-mode/tree/80ef38fb378541937f6ddfe836809e76eda1e355][Evil Org Github]]

#+begin_src emacs-lisp
(use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+end_src

#+RESULTS:
| (lambda nil evil-org-mode) | (lambda nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | org-tempo-setup | efs/org-mode-visual-fill | org-bullets-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | (lambda nil (display-line-numbers-mode 0)) |

** Auto tangle Config Files
 

 #+begin_src emacs-lisp

 (defun efs/org-babel-tangle-config ()
   (when (string-equal (file-name-directory (buffer-file-name))
                     (expand-file-name "c:/Users/Adrian/Documents/GitHub/emacs/"))

     ;; Dynamic scoping to the rescue
     (let ((org-confirm-babel-evaluate nil))
       (org-babel-tangle))))

 (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

 #+end_src

 #+RESULTS:
 | (lambda nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | org-tempo-setup | efs/org-mode-visual-fill | org-bullets-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | (lambda nil (display-line-numbers-mode 0)) |

** Dired
#+begin_src emacs-lisp

  (use-package dired
      :ensure nil
      :commands (dired dired-jump)
      :bind (("C-x C-j" . dired-jump))
      :custom ((dired-listing-switches "-agho --group-directories-first"))
      :config
      (evil-collection-define-key 'normal 'dired-mode-map
	"h" 'dired-single-up-directory
	"l" 'dired-single-buffer)

       (setq delete-by-moving-to-trash t)
       (setq-default dired-hide-details-mode t))

  (use-package dired-single
      :commands (dired dired-jump))

  (use-package all-the-icons-dired
      :hook (dired-mode . all-the-icons-dired-mode))

  ;(use-package dired-open
  ;    :commands (dired dired-jump)
  ;    :config
  ;    ;; Doesn't work as expected!
  ;    ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
  ;    (setq dired-open-extensions '(("pdf" . "feh")
				   ;; ("mkv" . "mpv"))))

#+end_src

#+RESULTS:
| dired-extra-startup | org-download-enable | all-the-icons-dired-mode | doom-modeline-set-project-modeline |
